Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedAreaLoad
Serialization structure for AnalysisDecomposedAreaLoad.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedAreaLoad.AnalysisDecomposedLoad
The analysis decomposed load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedAreaLoad._Direction
The direction of the analysis decomposed load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedAreaLoad._NumberOfPositions
The number of positions of the analysis decomposed load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedAreaLoad._PositionsX
The X coordinates of the positions of the analysis decomposed load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedAreaLoad._PositionsY
The Y coordinates of the positions of the analysis decomposed load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedAreaLoad._PositionsZ
The Z coordinates of the positions of the analysis decomposed load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedAreaLoad._Magnitudes
The magnitudes of the analysis decomposed load.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedAreaLoad.ToStruct(Tekla.Structures.Analysis.AnalysisDecomposedAreaLoad)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisDecomposedAreaLoad.FromStruct(Tekla.Structures.Analysis.AnalysisDecomposedAreaLoad)
DO NOT USE! For internal usage only!
P: P.